<template>
  <div class="bg-white w-full flex flex-col relative rounded-lg h-[380px]">
    <div
      class="flex h-10 bg-primary text-white top-0 right-0 w-full justify-between py-2 px-3 rounded-t-lg"
    >
      <span class="flex items-center"> برگزیده ها </span>
      <span class="flex items-center">
        <IconBookmark />
      </span>
    </div>
    <div class="relative z-0 overflow-y-scroll">
      <div class="overflow-x-hidden pt-3">
        <ul class="list-disc list-inside w-full">
          <li
            v-for="(item, index) in newsList"
            :key="index"
            class="text-right text-[12px] py-1 px-3 word-wrap flex items-center"
          >
            <h3>
              <nuxt-link class="flex" to="/">{{ item.title }}</nuxt-link>
            </h3>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup>
const newsList = ref([
  { title: "سنگربان پرسپولیسی «کاسیاس» شد", link: "#" },
  { title: "4 گل استقلال مقابل نساجی در نیمه نهایی", link: "#" },
  { title: "گل سوم استقلال به نساجی", link: "#" },
  { title: "عطوان: سیاستِ تل‌آویو شکست‌خورده است", link: "#" },
  { title: "گل دوم استقلال به نساجی", link: "#" },
  { title: "بازیکن استقلال محروم از فینال حذفی", link: "#" },
  { title: "نشست خبری رقابت‌های جام تختی کشتی", link: "#" },
  { title: "پی‌گیری مصوبات سفرهای استانی رئیس‌جمهور", link: "#" },
  { title: "راه‌اندازی خط تعمیر شیرهای کنترل‌کننده", link: "#" },
  { title: "کالابرگ الکترونیکی گسترش می‌یابد", link: "#" },
  { title: "روایت رهبر انقلاب از آزادی خرمشهر", link: "#" },
  { title: "شکستن شیشه‌های سالن هندبال در فینال", link: "#" },
  { title: "تکذیب گفت‌و‌گوی نتانیاهو و بن سلمان", link: "#" },
  { title: "آدم های مغرور چه ویژگی دارند؟", link: "#" },
  { title: "فیلم| شهید محمدصادق نیلی از زبان پدر", link: "#" },
  { title: "شلیک به سمت پهپاد اسرائیلی در سوریه", link: "#" },
  { title: "جام بین المللی کشتی تنها با حضور 2 کشور!", link: "#" },
  { title: "ترکیب نساجی مقابل استقلال در نیمه نهایی", link: "#" },
  { title: "قهرمانی سپاهان در لیگ برتر هندبال", link: "#" },
  { title: "برد پرگل تیم ملی ایران مقابل افغانستان", link: "#" },
  { title: "تأکید بر حضور زنان انقلابی در فضای مجازی", link: "#" },
  { title: "کم کاری بنیاد شهید در حوزه شهدای رسانه", link: "#" },
  { title: "انتصاب جانشین قرارگاه سازندگی خاتم‌", link: "#" },
  { title: "نقش رسانه در بازتاب مظلومیت آرمان", link: "#" },
  { title: "پایان کار نابغه در یک شانزدهم", link: "#" },
  { title: "شهیدی که با داشتن 7 فرزند به جبهه رفت", link: "#" },
  { title: "تولید انواع کیت مورد نیاز آزمایشگاه‌ها", link: "#" },
  { title: "یادواره 230 شهید خبرنگار", link: "#" },
  { title: "انجام تمهیدات لازم برای اجرای اربعین", link: "#" },
  { title: "اعزام بزرگترین ناو هواپیمابرجهان به نروژ", link: "#" },
  { title: "جهاد آب‌رسانی به روستاهای کازرون", link: "#" },
  { title: "خروج چند رادیکال از جرگه جناح چپ", link: "#" },
  { title: "ادعای بی نیازی عراق از گاز ایران تا 2026", link: "#" },
  { title: "دستورات سازمان بازرسى در خصوص سد فینسک", link: "#" },
  { title: "افزایش قیمت طلا", link: "#" },
  { title: "ترکیب استقلال برای بازی نیمه نهایی حذفی", link: "#" },
  { title: "قدردانی ویژه ساپینتو از هواداران استقلال", link: "#" },
  { title: "شهیدی که خود را سرباز امام زمان(عج)خواند", link: "#" },
  { title: "تهران بارانی می شود", link: "#" },
  { title: "حیات بیماران به این ماده بستگی دارد؟", link: "#" },
  { title: "حمایت چین از منافع کلیدی روسیه", link: "#" },
  { title: "اهالی رسانه باید تحلیلگر باشند", link: "#" },
  { title: "کم کاری رسانه برای برخی شهدا", link: "#" },
  { title: "آلمان در مدار صفر درجه رشد اقتصادی", link: "#" },
  { title: "اعتراض داورزنی به میزبانی آمریکاجواب داد", link: "#" },
  { title: "یک میلیون یورو تاانتقال طارمی به عربستان", link: "#" },
  { title: "۵۶ کاروان‌سرای ایران ثبت جهانی می‌شود", link: "#" },
  { title: "رونمایی از درصد انتقال مسی به عربستان", link: "#" },
  { title: "احداث 8 ایستگاه مترو در خط 4", link: "#" },
  { title: "معافیت از خدمت سربازی برای پدران۳ فرزند", link: "#" },
]);
</script>
